tap "charmbracelet/tap"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "cloc"
brew "cloudflared"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fswatch"
brew "gh"
brew "git"
brew "git-delta"
brew "helm"
brew "llvm"
brew "lld"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "nushell"
brew "pnpm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "rbenv"
brew "ripgrep"
brew "sd"
brew "starship"
brew "swiftlint"
brew "uv"
brew "wget"
brew "xcode-build-server"
brew "xcodegen"
brew "zig"
brew "zola"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "charmbracelet/tap/crush"
brew "qmk/qmk/qmk"
cask "nikitabobko/tap/aerospace@0.12.0"
cask "deskpad"
cask "font-iosevka-nerd-font"
cask "mitmproxy"
cask "ngrok"
cask "raycast"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "christopherstyles.html-entities"
vscode "cpylua.language-postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hookyqr.beautify"
vscode "mechatroner.rainbow-csv"
vscode "mikeburgh.xml-format"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nikhilkumar80.js-patterns-snippets"
vscode "pikamachu.require-cartridge-resolve"
vscode "platformio.platformio-ide"
vscode "prisma.prisma"
vscode "rafamel.subtle-brackets"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "shardulm94.trailing-spaces"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "visualstudiotoolsforunity.vstuc"
vscode "wayou.vscode-todo-highlight"
go "golang.org/x/tools/gopls"
cargo "wasm-pack"
